Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་ནི་འདས་པ་མ་ཡིན། མ་འོངས་པ་མ་ཡིན། ད་ལྟར་བྱུང་བ་མ་ཡིན་ཏེ། དུས་གསུམ་མཉམ་པ་ཉིད་འཁོར་གསུམ་ཡོངས་སུ་ཆད་པའོ། ། དེ་ལ་འཁོར་གསུམ་ཡོངས་སུ་ཆད་པ་གང་ཞེ་ན། གང་འདས་པ་ལ་སེམས་མི་འཇུག་པ་དང་། མ་འོངས་པ་ལ་རྣམ་པར་ཤེས་པ་རྗེས་སུ་མི་རྒྱུག་པ་དང་། ད་ལྟར་བྱུང་བ་ལ་ཡིད་ལ་བྱེད་པ་མི་འཇུག་པ་སྟེ། དེ་སེམས་དང་། ཡིད་དང་། རྣམ་པར་ཤེས་པ་ལ་མི་གནས་པས་འདས་པ་ལ་མི་རྟོག ། མ་འོངས་པ་ལ་རློམ་སེམས་སུ་མི་བྱེད། ད་ལྟར་བྱུང་བ་ལ་སྤྲོས་པར་མི་བྱེད་པ་འདི་ནི་དུས་གསུམ་མཉམ་པ་ཉིད་འཁོར་གསུམ་ཡོངས་སུ་དག་པ་ཡིན་ན་སེམས་ཅན་རྣམས་ཀྱིས་ཁོང་དུ་མ་ཆུད་པས་དེ་ཁོང་དུ་ཆུད་པར་བྱའོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་འཇུག་གོ །
en: “Śāriputra, awakening is not of the past. It is not of the future. It is not of the present. It is the same with regard to the three times, and it has cut through the three spheres. In what way has it cut through the three spheres? It does not engage with thoughts of the past, it does not pursue ideas of the future, and it is not occupied with thoughts in the present. With great compassion for sentient beings, the Tathāgata sees that they do not recognize this sameness of the three times, the purification of the three spheres, which is not limited by mind, thoughts, or consciousness and does not conceptualize the past, think about the future, or elaborate on the present, and so he pledges to help them realize it.

source: ཤཱ་རིའི་བུ་ངས་བྱང་ཆུབ་ནི་ལུས་མེད་པ་མངོན་པར་འདུས་མ་བྱས་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། དེ་ནི་མིག་གི་རྣམ་པར་ཤེས་པས་རྣམ་པར་ཤེས་པ་བྱ་བ་མ་ཡིན་པ་ནས། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་བར་གྱིས་རྣམ་པར་ཤེས་པར་བྱ་བ་མ་ཡིན་ནོ། ། འདུས་མ་བྱས་ཞེས་བྱ་བ་ནི་གང་མ་སྐྱེས་པ། མི་འཇིག་པ། མི་གནས་པ་དེ་ནི་འཁོར་གསུམ་དང་བྲལ་བ། འདུས་མ་བྱས་ཤེས་བྱའོ། ། འདུས་མ་བྱས་ཇི་ལྟ་བར་འདུས་བྱས་ཀྱང་དེ་ལྟར་ཁོང་དུ་ཆུད་པར་བྱའོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། གང་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་དེ་ནི་དངོས་པོ་མེད་པའོ། ། གང་དངོས་པོ་མེད་པ་དེ་ལ་གཉིས་མེད་དེ། ལུས་མེད་པ། མངོན་པར་འདུས་མ་བྱས་པ་དེ་སེམས་ཅན་རྣམས་ཀྱིས་ཁོང་དུ་མ་ཆུད་པས་དེ་ཁོང་དུ་ཆུད་པར་བྱའོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་འཇུག་གོ །
en: “Śāriputra, awakening is an unembodied and unconditioned complete realization. It is not perceived by the eye consciousness, and is likewise not perceived by the others, up to and including the mind consciousness. It is said to be unconditioned as it is not something that appears, disintegrates, or remains. In this way one can say that it is free from the three spheres and unconditioned. One should understand the conditioned in the same way one understands the unconditioned. How should one thus understand the conditioned? There are no phenomena that have a real essential nature. As there are no real entities there, there is no duality. With great compassion for sentient beings, the Tathāgata sees that they do not recognize the unembodied and unconditioned, and so he pledges to help them realize it.

source: ཤཱ་རིའི་བུ་ངས་བྱང་ཆུབ་ནི་དབྱེར་མེད་པ་དང་། གནས་སུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། ། དེ་ལ་དབྱེར་མེད་པ་གང་། གནས་གང་ཞེ་ན། དེ་ལ་དེ་བཞིན་ཉིད་ནི་གནས་སོ། ། གནས་མེད་པ་ནི་དབྱེར་མེད་པའོ། ། ཆོས་ཀྱི་དབྱིངས་ནི་གནས་སོ། ། ཐ་དད་པ་མེད་པ་ནི་དབྱེར་མེད་པའོ། ། ཡང་དག་པའི་མཐའ་ནི་གནས་སོ། ། གཡོ་བ་མེད་པ་ནི་དབྱེར་མེད་པའོ། ། སྟོང་པ་ཉིད་ནི་གནས་སོ། ། དམིགས་སུ་མེད་པ་ནི་དབྱེར་མེད་པའོ། ། མཚན་མ་མེད་པ་ནི་གནས་སོ། ། རྣམ་པར་མི་རྟོག་པ་ནི་དབྱེར་མེད་པའོ། ། སྨོན་པ་མེད་པ་ནི་གནས་སོ། ། འཇུག་པ་མེད་པ་ནི་དབྱེར་མེད་པའོ། ། སེམས་ཅན་མེད་པ་ནི་གནས་སོ། ། སེམས་ཅན་མེད་པའི་རང་བཞིན་ནི་དབྱེར་མེད་པའོ། ། ནམ་མཁའ་ནི་གནས་སོ། ། མི་དམིགས་པ་ནི་དབྱེར་མེད་པའོ། ། མི་སྐྱེ་བ་ནི་གནས་སོ། ། མི་འགག་པ་ནི་དབྱེར་མེད་པའོ། ། འདུས་མ་བྱས་ནི་གནས་སོ། ། རྒྱུ་བ་མེད་པ་ནི་དབྱེར་མེད་པའོ། ། བྱང་ཆུབ་ནི་གནས་སོ། ། ཉེ་བར་ཞི་བ་ནི་དབྱེར་མེད་པའོ། ། མྱ་ངན་ལས་འདས་པ་ནི་གནས་སོ། ། མངོན་པར་མི་འགྲུབ་པ་ནི་དབྱེར་མེད་པའོ། །
en: “Śāriputra, awakening is an indivisible state of complete realization. In what way is it indivisible, and in what way is it a state? It is the state of truth: as it is unsupported, it is indivisible. It is the state of the totality of phenomena: as it is not varied, it is indivisible. It is the summit of existence: as it is immovable, it is indivisible. It is the state of emptiness: as it cannot be apprehended, it is indivisible. It is the state of freedom from attributes: as it is unimaginable, it is indivisible. It is the wishless state of freedom from aspirations: as it is without engagement, it is indivisible. It is the state of no sentient beings: as its nature is devoid of sentient beings, it is indivisible. It is the state of space: as it cannot be apprehended, it is indivisible. It is the unborn state: as it is unceasing, it is indivisible. It is the unconstructed state: as it is not distracted, it is indivisible. It is the state of awakening: as it is tranquil, it is indivisible. It is the state of nirvāṇa: as it is not something to be accomplished, it is indivisible. Śāriputra, with great compassion for sentient beings, the Tathāgata sees that they do not recognize this indivisible state, and so he pledges to help them realize it.

source: དེ་ལྟར་ཤཱ་རིའི་བུ་དབྱེར་མེད་པའི་གནས་འདི་སེམས་ཅན་རྣམས་ཀྱིས་ཁོང་དུ་མ་ཆུད་པས་དེ་ཁོང་དུ་ཆུད་པར་བྱའོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་འཇུག་གོ ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་ནི་ལུས་ཀྱིས་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་ཏེ་སེམས་ཀྱིས་ཀྱང་མ་ཡིན་ནོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ལུས་ནི་བེམས་པོ་གཡོ་བ་མེད་པ། བྱེད་པ་མེད་པ། རྩྭ་དང་། རྩིག་པ་དང་ཤིང་དང་། རྡོ་དང་། མིག་ཡོར་ལྟ་བུའོ། ། སེམས་ནི་སྒྱུ་མ་དང་། སྨིག་རྒྱུ་དང་། ཆུ་ཟླ་ལྟ་བུ་སྟེ། གང་གིས་ལུས་དང་། སེམས་དེ་ལྟར་ཁོང་དུ་ཆུད་པ་དེ་ནི་བྱང་ཆུབ་ཅེས་བྱའོ། ། བྱང་ཆུབ་ནི་ཐ་སྙད་ཙམ་དུ་བཟུང་བ་སྟེ། བྱང་ཆུབ་ནི་ལུས་སམ། སེམས་སམ། ཆོས་སམ། ཆོས་མ་ཡིན་པ་འམ། ཡང་དག་པ་འམ། ཡང་དག་པ་མ་ཡིན་པའམ། བདེན་པ་འམ། བརྫུན་པ་གང་གིས་ཀྱང་བརྗོད་པར་བྱ་བ་མ་ཡིན་ནོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱང་ཆུབ་ནི་ཆོས་ཐམས་ཅད་ཀྱིས་བརྗོད་པར་བྱ་བ་མ་ཡིན་ཏེ། བྱང་ཆུབ་ལ་ནི་གང་གིས་ཀྱང་ཚིག་གི་ཐ་སྙད་དུ་འགྱུར་བའི་གནས་ཅུང་ཟད་ཀྱང་མེད་དོ། ། ཇི་ལྟར་ནམ་མཁའ་གནས་མེད་ཅིང་ཚིག་མེད་པ་དེ་བཞིན་དུ་བྱང་ཆུབ་ཀྱང་གནས་མེད་པ། བརྗོད་པར་བྱ་བ་མ་ཡིན་པའོ། །
en: “Śāriputra, awakening is not realized by means of the body or by means of the mind. How so? The body is lifeless, powerless, and ineffective, like grass, plaster, wood, rock, or a reflection. The mind is like an illusion, a mirage, like the reflection of the moon on water. One can say that awakening is a realization of body and mind. This is, however, just a conventional way of approaching awakening. Awakening cannot be expressed verbally in any way, as anything physical or mental, as phenomena or non-phenomena, as existence or nonexistence, as truth or falsity. How so? Awakening cannot be expressed verbally by means of any phenomena, as there are no conventional words applicable to awakening. Just as space is not a condition and cannot be expressed, awakening is not a state that can be expressed. Therefore, Śāriputra, when searching for the true state of things, all phenomena are without expression. One does not find expressions in phenomena, nor does one find phenomena in expressions. With great compassion for sentient beings, the Tathāgata sees that they do not understand and recognize that this is the way phenomena work, and so he pledges to help them realize it.

source: དེ་ལྟར་ཤཱ་རིའི་བུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཚོལ་བ་ན་ཆོས་ཐམས་ཅད་ཚིག་མེད་པ་སྟེ། ཆོས་ལ་ཚིག་མེད། ཚིག་ལ་ཡང་ཆོས་མེད་དོ། ། དེ་ལྟ་བུའི་ཆོས་ཀྱི་ཚུལ་མི་ཤེས་ཤིང་ཁོང་དུ་མ་ཆུད་པས་དེ་ཁོང་དུ་ཆུད་པར་བྱའོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་འཇུག་གོ ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་ནི་གཟུང་བ་མེད་པ། ཀུན་གཞི་མེད་པའོ། ། དེ་ལ་གཟུང་བ་མེད་པ་གང་། ཀུན་གཞི་མེད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མིག་ཡོངས་སུ་ཤེས་པ་ནི་གཟུང་བ་མེད་པའོ། ། གཟུགས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་ནི་ཀུན་གཞི་མེད་པའོ། ། ཡིད་ཀྱི་བར་དུ་ཡོངས་སུ་ཤེས་པ་ནི་གཟུང་བ་མེད་པའོ། ། ཆོས་མི་དམིགས་པ་ནི་ཀུན་གཞི་མེད་པ་སྟེ། དེ་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པས་གཟུང་བ་མེད་པ། ཀུན་གཞི་མེད་པར་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། ། མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་མིག་མི་འཛིན་པ་དང་། གཟུགས་ཀུན་གཞི་མེད་པས་རྣམ་པར་ཤེས་པ་མི་གནས་སོ། ། ཡིད་ཀྱི་བར་དུ་མི་འཛིན་ཅིང་ཆོས་ཀུན་གཞི་མེད་པས་རྣམ་པར་ཤེས་པ་མི་གནས་སོ། ། དེ་རྣམ་པར་ཤེས་པ་མི་གནས་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་གནས་ཤེས་སོ། ། ཇི་ལྟར་ཤེས་ཞེ་ན། སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཀྱི་གནས་ནི་བཞི་སྟེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། གཟུགས་ནི་སེམས་ཀྱི་གནས་སོ། ། ཚོར་བ་དང་། འདུ་ཤེས་དང་འདུ་བྱེད་ནི་སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཀྱི་གནས་ཏེ། འདི་བཞི་ནི་སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཀྱི་གནས་སོ། ། གནས་དེ་ཡང་གནས་མེད་པར་དེ་བཞིན་གཤེགས་པས་མཁྱེན་ཏེ། གནས་མེད་པའི་མཐའ་འདི་སེམས་ཅན་རྣམས་ཀྱིས་ཁོང་དུ་མ་ཆུད་པས་དེ་ཁོང་དུ་ཆུད་པར་བྱའོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་འཇུག་གོ །
en: “Śāriputra, awakening cannot be grasped and does not rest anywhere. In what way can it not be grasped, and in what way does it not rest anywhere? It cannot be grasped by visual cognition, and as it cannot be seen as form, it does not rest anywhere. It cannot be grasped by the other forms of cognition up to and including mental cognition, and as it cannot be apprehended as a mental object, it does not rest anywhere. So it is, Śāriputra, that the Tathāgata has realized awakening that cannot be grasped and does not rest anywhere. With this realization, the eye does not grasp and form does not rest anywhere, so consciousness is not fixed in any way. With this realization, the other faculties up to and including the mind do not grasp and mental phenomena do not rest anywhere, so consciousness is not fixed in any way. This unfixed consciousness knows the mental states of all sentient beings. How does it know them? There are four ways in which the minds of sentient beings become fixed. What are they? The mind can become fixed on form, and the mind of sentient beings can become fixed on feeling, perception, and mental conditioning. These are the four ways in which the minds of sentient beings become fixed, and the Tathāgata has come to know these ways of being fixed as unfixed. With great compassion for sentient beings, the Tathāgata sees that they do not recognize the way in which things are ultimately unfixed, and so he pledges to help them realize it.

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་ཅེས་བྱ་བ་ནི་སྟོང་པ་ཉིད་ཀྱི་ཚིག་བླ་དགས་སོ། ། སྟོང་པ་ཉིད་གང་གིས་བྱང་ཆུབ་སྟོང་པ་སྟོང་པ་ཉིད་དེས་ཆོས་ཐམས་ཅད་སྟོང་སྟེ། དེ་དག་སྟོང་པ་ཇི་ལྟ་བ་བཞིན་དུ་དེ་ལྟར་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་མོད་ཀྱི་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་པ་ཉིད་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ནི་མ་ཡིན་པས་སྟོང་པ་ཉིད་དམ། བྱང་ཆུབ་ཅེས་བྱ་བ་འདི་ནི་ཚུལ་གཅིག་པའི་ཡེ་ཤེས་སོ། ། དེ་ལ་གཉིས་པོ་གང་གིས་སྟོང་པ་ཉིད་དང་། བྱང་ཆུབ་ཏུ་གཉིས་སུ་དབྱེ་བའི་གཉིས་གང་ཡང་མེད་དོ། ། ཆོས་དེ་ནི་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་དབྱེར་མེད་དེ་མིང་མེད་པ། མཚན་མ་མེད་པ། འཇུག་པ་མེད་པ། རབ་ཏུ་རྒྱུ་བ་མེད་པ། སྤྱོད་པ་མེད་པའོ། ། གང་སྟོང་པ་ཞེས་བྱ་བ་ནི་མངོན་པར་ཆགས་པ་དང་། འཛིན་པ་དང་བྲལ་བའོ། ། དོན་དམ་པར་ཆོས་གང་ཡང་མི་དམིགས་པས་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་སྟོང་པ་ཞེས་བྱའོ། ། ཇི་ལྟར་ནམ་མཁའ་ནམ་མཁའ་ཞེས་ཀྱང་བྱ་ལ་ནམ་མཁའ་ནི་བརྗོད་པར་བྱ་བའང་མ་ཡིན་ནོ། ། དེ་བཞིན་དུ་སྟོང་པ་སྟོང་པ་ཞེས་ཀྱང་བྱ་ལ་སྟོང་པ་ཉིད་བརྗོད་པར་བྱ་བ་མ་ཡིན་ནོ། འདི་ལྟ་སྟེ། མིང་ཙམ་དུ་ཐ་སྙད་འདོགས་པ་འདི་ནི་ཆོས་ཐམས་ཅད་ལ་འཇུག་པ་སྟེ། མིང་དེ་ཡང་ཡུལ་ན་མི་གནས། ཕྱོགས་ན་མི་གནས་སོ། ། ཇི་ལྟར་མིང་ཡུལ་ན་མི་གནས། ཕྱོགས་ན་མི་གནས་པ་དེ་བཞིན་དུ་ཆོས་ཀྱི་མིང་གིས་ཐ་སྙད་དུ་འདོགས་པའི་ཆོས་དེ་ཡང་ཡུལ་ན་མི་གནས། ཕྱོགས་ན་མི་གནས་ཏེ། དེ་ལྟར་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་མཁྱེན་ཏོ། ། ཐོག་མ་ནས་མ་སྐྱེས་མ་བྱུང་བར་དེ་ལྟར་མཁྱེན་པས་དེ་ལྟར་རྣམ་པར་གྲོལ་ཏེ་བཅིངས་པ་ཡང་མེད། གྲོལ་བ་ཡང་མེད་ན་ དེ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱིས་ཁོང་དུ་མ་ཆུད་པས་དེ་ཁོང་དུ་ཆུད་པར་བྱའོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་འཇུག་གོ །
en: “Śāriputra, awakening is a designation of emptiness. Because of emptiness, awakening is empty, and because of this emptiness, all phenomena are empty. The Tathāgata has realized that emptiness is indeed exactly how all phenomena are. Could it then be that because of emptiness the realization of emptiness does not take place? The Tathāgata knows that emptiness and awakening are a single principle. One cannot make any distinction between these two things, emptiness and awakening. This phenomenon of nonduality and indivisibility has no name, no attributes. One cannot access it, one cannot engage with it in any way, and one cannot practice it. What is said to be empty is devoid of inclinations and grasping. Ultimately there is no phenomenon that is apprehended, and as it is empty in this manner it is described as empty. Space is called space even though there is no way to describe space, and likewise the empty is called empty even though there is no way to describe emptiness. In this way, one engages with all phenomena and gives them conventional designations, but the name is not something that is inherent in the object or its parts. This is how the Tathāgata understands all phenomena. As he understands that they are primordially unborn and unarisen, he is liberated and not confined in any way. With great compassion for sentient beings, the Tathāgata sees that ordinary, immature beings are not free and do not recognize this, and so he pledges to help them realize it.

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་ནི་ནམ་མཁའ་དང་མཉམ་སྟེ། ནམ་མཁའ་ནི་མཉམ་པ་ཡང་མ་ཡིན་མི་མཉམ་པའང་མ་ཡིན་ནོ། ། བྱང་ཆུབ་ཀྱང་མཉམ་པ་འང་མ་ཡིན། མི་མཉམ་པ་འང་མ་ཡིན་ཏེ། ཇི་ལྟར་ཆོས་རྣམས་ཡང་དག་པར་ཡོངས་སུ་གྲུབ་པ་མེད་པ་དེ་མཉམ་པའམ་མི་མཉམ་པ་ཞེས་བརྗོད་པ་མ་ཡིན་ནོ། ། དེ་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་མཉམ་པ་འང་མ་ཡིན། མི་མཉམ་པར་ཡང་མ་ཡིན་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། ། ཇི་ལྟར་ཆོས་རྡུལ་ཙམ་ཡང་མཉམ་པར་བྱས་པ་ཡང་མ་ཡིན། མི་མཉམ་པར་བྱས་པ་ཡང་མ་ཡིན་པ་དེ་ལྟར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། ། ཆོས་ཇི་སྙེད་པ་དེ་དག་ཡང་དག་པའི་ཡེ་ཤེས་ཀྱིས་ཤེས་སོ། ། ཡང་དག་པའི་ཡེ་ཤེས་གང་ཞེ་ན། ཆོས་མ་བྱུང་བ་རྣམས་འབྱུང་བ་དང་། བྱུང་ནས་འཇིག་པར་འགྱུར་བ་དེ་དག་ནི་བདག་པོ་མེད་པར་འབྱུང་། བདག་པོ་མེད་པར་འཇིག་སྟེ། རྐྱེན་གྱིས་འབྱུང་བ་དང་། འཇིག་པར་འགྱུར་ཞིང་འདི་ལ་འཇུག་པ་འམ། ལྡོག་པ་གང་ཡང་མེད་དེ། ལམ་གཅད་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཆོས་སྟོན་ཏོ། ། ལམ་གཅད་པ་འདི་སེམས་ཅན་རྣམས་ཀྱིས་ཁོང་དུ་མ་ཆུད་པས་དེ་ཁོང་དུ་ཆུད་པར་བྱའོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་འཇུག་གོ །
en: “Śāriputra, awakening is like space. Space is neither homogeneous nor heterogeneous, and awakening too is neither homogeneous nor heterogeneous. Just as one cannot say that phenomena are either homogeneous or heterogeneous because they do not really exist, the Tathāgata’s full understanding of all phenomena, Śāriputra, is neither homogeneous nor heterogeneous. He fully understands that the smallest phenomenal entity is neither homogeneous nor heterogeneous, and however many phenomena there are, he knows them as such with his genuine knowledge. What is genuine knowledge? After not existing, phenomena come about, and after existing, they disintegrate. They come about without an owner, and they disintegrate without an owner. Arising and destruction take place on the basis of conditions, but there is no thing there that takes place or ceases. It is said that the Tathāgata teaches the Dharma in order to put an end to worldly paths. With great compassion for sentient beings, the Tathāgata sees that they are not able to put an end to worldly paths, and so he pledges to help them put an end to them.

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་དེ་ནི་ཇི་ལྟ་བ་བཞིན་གྱི་གནས་སོ། ། བྱང་ཆུབ་ཇི་ལྟ་བར་གཟུགས་ཀྱང་དེ་བཞིན་ཏེ་དེ་བཞིན་ཉིད་ཀྱིས་མི་འབྱུང་ངོ་། ། བྱང་ཆུབ་ཇི་ལྟ་བ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་འང་དེ་བཞིན་ཏེ། དེ་བཞིན་ཉིད་ཀྱིས་མི་འབྱུང་ངོ་། ། བྱང་ཆུབ་ཇི་ལྟ་བ་བཞིན་དུ་སའི་ཁམས་དང་། ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་ཀྱང་དེ་བཞིན་ཏེ། དེ་བཞིན་ཉིད་ཀྱིས་མི་འབྱུང་ངོ་། ། བྱང་ཆུབ་ཇི་ལྟ་བ་བཞིན་དུ་མིག་གི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ནས། ཡིད་ཀྱི་ཁམས་དང་། ཆོས་ཀྱི་ཁམས་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་བར་དུའོ། །ཆོས་རྣམས་ཀྱི་བཏགས་པ་ནི་འདི་ཙམ་དུ་ཟད་དེ་དེ་ ནི་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་རྣམས་སུ་བཏགས་པ་སྟེ། དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། ། ཕྱིན་ཅི་མ་ལོག་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པས་ན་སྔོན་ཇི་ལྟ་བར་ཕྱིས་ཀྱང་དེ་བཞིན། བར་དུ་ཡང་དེ་བཞིན་ཏེ། སྔོན་གྱི་མཐའ་ནས་མ་སྐྱེས། ཕྱི་མའི་མཐར་མི་འཕོའོ། ། བར་དུ་ཡང་དབེན་པ་སྟེ། དེ་ལྟར་དེ་དག་ནི་ཇི་ལྟ་བ་བཞིན་གྱི་གནས་ཡིན་ནོ། ། གཅིག་ཇི་ལྟ་བར་ཐམས་ཅད་ཀྱང་དེ་བཞིན་ནོ། ། ཐམས་ཅད་ཇི་ལྟ་བར་གཅིག་ཀྱང་དེ་བཞིན་ཏེ། ། ཇི་ལྟ་བ་བཞིན་ནི་གཅིག་གམ་མང་པོར་མི་འགྱུར་རོ། ། ཇི་ལྟ་བ་བཞིན་གྱི་གནས་དེ་སེམས་ཅན་རྣམས་ཀྱིས་ཁོང་དུ་མ་ཆུད་པས་དེ་ཁོང་དུ་ཆུད་པར་བྱའོ། ། ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་འཇུག་གོ །
en: “Śāriputra, awakening is the state of things just as they are. What is the state of things just as they are? In the same way as awakening, form also does not change because it is just as it is. In the same way as awakening, feeling, perception, mental conditioning, and consciousness do not change because they are just as they are. In the same way as awakening, the earth element, the water element, the fire element, and the wind element do not change because they are just as they are. Just as it is with awakening, so is it with the eye element, the element of form, the element of eye consciousness, and so forth, the mind element, the element of mental phenomena, and the element of mind consciousness—these are merely ideas one has about phenomena, as in the case of the cognition of skandhas, elements, and sense fields. The Tathāgata fully understands their state just as it is; he understands it unmistakenly. It will be the same in the future as it was in the past, and in the time in between. All these things are unarisen from the very beginning. They do not pass away in the end, and they are transcendent in the time in between. This is the state of these things just as they are. In this way, all things are like a single thing, and a single thing is like all things. Thus, the state of these things just as they are is that there is no singularity or plurality. With great compassion for sentient beings, the Tathāgata sees that they do not realize the state of things just as they are, and so he pledges to help them realize it.

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་ནི་རྣམ་པ་ལ་འཇུག་པ་རྣམ་པ་མེད་པ་ལ་ཞུགས་པའོ། ། དེ་ལ་རྣམ་པ་གང་། རྣམ་པ་མེད་པ་གང་ཞེ་ན། ཤཱ་རིའི་བུ་རྣམ་པ་ཞེས་བྱ་བ་ནི་དགེ་བའི་ཆོས་རྣམས་རྩོམ་པའོ། ། རྣམ་པ་མེད་པ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་མི་དམིགས་པའོ། ། རྣམ་པ་ཞེས་བྱ་བ་ནི་མི་གནས་པའི་སེམས་ཀྱི་གནས་སོ། ། རྣམ་པ་མེད་པ་ཞེས་བྱ་བ་ནི་རྣམ་པར་ཐར་པའི་སྒོ་མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་ཏོ། ། རྣམ་པ་ཞེས་བྱ་བ་ནི་སེམས་གཞལ་བ་དང་། བགྲང་བ་དང་། སོ་སོར་རྟོག་པའོ། ། རྣམ་པ་མེད་པ་ཞེས་བྱ་བ་ནི་གཞལ་བ་ལས་ཡང་དག་པར་འདས་པའོ། ། གཞལ་བ་ལས་ཡང་དག་པར་འདས་པ་གང་ཞེ་ན། གང་ན་རྣམ་པར་ཤེས་པའི་ལས་མེད་པའོ། ། རྣམ་པ་ཞེས་བྱ་བ་ནི་གང་ན་འདུས་བྱས་ལ་སོ་སོར་རྟོག་པའོ། ། རྣམ་པ་མེད་པ་ནི་འདུས་མ་བྱས་མངོན་སུམ་དུ་བྱེད་པ་སྟེ། རྣམ་པ་དང་རྣམ་པ་མེད་པ་ལ་འཇུག་པ་འདི་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱིས་ཁོང་དུ་མ་ཆུད་པས་དེ་ཁོང་དུ་ཆུད་པར་བྱའོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་འཇུག་གོ །
en: “Śāriputra, awakening is to make use of qualities while dwelling in the absence of qualities. What are qualities and what is the absence of qualities in this regard? Śāriputra, what is called qualities is engagement with wholesome conduct, while what is called the absence of qualities is the fact that no phenomena can be apprehended. What is called qualities is to dwell in the nondwelling mind, while what is called the absence of qualities is the concentration that is free from attributes, the entryway to liberation. What is called qualities is the mind that ponders, reckons, and examines, while what is called the absence of qualities is beyond pondering. In what way is it beyond pondering? There is no conscious activity anywhere. With what is called qualities there is examination of compounded things. With the absence of qualities, there is direct realization of the uncompounded. With great compassion for sentient beings, the Tathāgata sees that ordinary, immature beings do not recognize this utilization of qualities and the absence of qualities, and so he pledges to help them realize it.

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་ནི་ཟག་པ་མེད་པ། ལེན་པ་མེད་པའོ། ། དེ་ལ་ཟག་པ་མེད་པ་གང་། ལེན་པ་མེད་པ་གང་ཞེ་ན། ཟག་པ་མེད་པ་ཞེས་བྱ་བ་ནི་ཟག་པ་བཞི་དང་བྲལ་བ་སྟེ། འདོད་པའི་ཟག་པ་དང་བྲལ་བ་དང་། སྲིད་པའི་ཟག་པ་དང་བྲལ་བ་དང་། མ་རིག་པའི་ཟག་པ་དང་བྲལ་བ་དང་། ལྟ་བའི་ཟག་པ་དང་བྲལ་བའོ། ། ཉེ་བར་ལེན་པ་མེད་པ་ཞེས་བྱ་བ་ནི་ལེན་པ་བཞི་དང་བྲལ་བ་སྟེ། འདོད་པའི་ལེན་པ་དང་བྲལ་བ་དང་། སྲིད་པའི་ལེན་པ་དང་བྲལ་བ་དང་། ལྟ་བའི་ལེན་པ་དང་བྲལ་བ་དང་། ཚུལ་ཁྲིམས་དང་བརྟུལ་ཞུགས་ཀྱི་ལེན་པ་དང་བྲལ་བའོ། ། དེ་ལ་ཉེ་བར་ལེན་པ་བཞི་པོ་དེ་དག་ཐམས་ཅད་ནི་མ་རིག་པས་མདོངས་པར་བྱས་པ་དང་། སྲིད་པའི་ཆུས་གཡོགས་པ་དང་། བདག་ཏུ་མངོན་པར་ཆགས་པས་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ལེན་ཏོ། ། དེ་ལ་དེ་བཞིན་གཤེགས་པས་བདག་ཉེ་བར་ལེན་པའི་རྩ་བ་ཡོངས་སུ་མཁྱེན་པའི་ཕྱིར་བདག་རྣམ་པར་དག་པས་སེམས་ཅན་རྣམ་པར་དག་པར་མཁྱེན་ཏོ། ། བདག་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ལ་ཡོངས་སུ་རྟོག་པ་གང་གིས་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པར་འགྱུར་བའི་ཡོངས་སུ་རྟོག་པ་གང་ཡང་མེད་དེ། དེ་ནི་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་དང་ལྡན་པས་མ་རིག་པ་ཀུན་ནས་མི་སློང་ངོ་། ། མ་རིག་པ་ཀུན་ནས་མི་སློང་བས་སྲིད་པའི་ཡན་ལག་བཅུ་གཉིས་ཀུན་ནས་མི་ལྡང་བ་དེ་ནི་སྐྱེ་བ་མེད་པའོ། ། གང་སྐྱེ་བ་མེད་པ་དེ་ནི་ངེས་པར་གྱུར་པའོ། ། གང་ངེས་པར་གྱུར་པ་དེ་ནི་ངེས་པའི་དོན་ཏོ། ། གང་ངེས་པའི་དོན་དེ་ནི་དོན་དམ་པའོ། ། གང་དོན་དམ་པ་དེ་གང་ཟག་མེད་པའི་དོན་ཏོ། ། གང་གང་ཟག་མེད་པའི་དོན་དེ་བརྗོད་དུ་མེད་པའི་དོན་ཏོ། ། གང་བརྗོད་དུ་མེད་པའི་དོན་དེ་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་དོན་ཏོ། ། གང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་དོན་དེ་ཆོས་ཀྱི་དོན་ཏོ། ། གང་ཆོས་ཀྱི་དོན་དེ་དེ་བཞིན་གཤེགས་པའི་དོན་ཏེ་དེའི་ཕྱིར་སུས་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་མཐོང་བ་དེས་ཆོས་མཐོང་ངོ་། ། སུས་ཆོས་མཐོང་བ་དེས་དེ་བཞིན་གཤེགས་པ་མཐོང་སྟེ། འདི་ལྟར་དེ་བཞིན་ཉིད་དུ་བཙལ་ན་ཅི་ཡང་མི་མཐོང་བ་དེ་ལྟར་མཐོང་། དེ་ལ་ཅི་ཡང་ཞེས་བྱ་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མཚན་མ་མེད་པ་དང་། དམིགས་པ་མེད་པའོ། ། གང་གིས་མཚན་མ་མེད་པ་དང་། དམིགས་པ་མེད་པ་མཐོང་བ་དེས་ཡང་དག་པར་མཐོང་སྟེ། དེ་ལྟར་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་མཉམ་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། ། ཟག་པ་མེད་པ་དང་། ལེན་པ་མེད་པ་འདི་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱིས་ཁོང་དུ་མ་ཆུད་པས་དེ་ཁོང་དུ་ཆུད་པར་བྱའོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་འཇུག་གོ །
en: “Śāriputra, awakening is undefiled and without clinging. What is it to be undefiled and what is to be without clinging in this regard? To be ‘undefiled’ is to be free from the four defilements: the defilement of desire, the defilement of existence, the defilement of ignorance, and the defilement of views. To be without clinging is to be free from the four types of clinging: clinging to desire, clinging to existence, clinging to views, and clinging to morality and rituals. All who engage in these four types of clinging are blinded by ignorance and drenched by the waters of desire. When one adheres to a self, one clings to skandhas, elements, and sense fields. Because he knows the root of this self-clinging thoroughly and has purified himself, the Tathāgata is able to successfully purify sentient beings. He who has fully purified himself does not harbor any sort of assumption. He who harbors assumptions because of engaging in superficial mental activity is not able to engage in non-superficial mental activity, because of his ignorance. He who does not allow ignorance to proliferate does not see the appearance of the twelve limbs of existence, and there is then no birth. To be free of birth is to arrive at certainty. When one arrives at certainty, the clear, explicit truth is established. When the clear, explicit truth is established, one has arrived at the ultimate truth. The ultimate truth is that no person really exists. The truth that no person exists is the truth of inexpressibility. The truth of inexpressibility is the reality of dependent origination. The reality of dependent origination is the reality of phenomena. The reality of phenomena is the reality of the Tathāgata. That is why it is said that one who sees dependent origination sees the Dharma, and one who sees the Dharma sees the Tathāgata. Thus, when he sees, searching for the truth, he does not see anything. What is ‘anything’ in this regard? It is the freedom from attributes and the lack of anything that is apprehended. One who sees the freedom from attributes and the lack of anything that is apprehended sees what is real. In this way, the Tathāgata’s full understanding of all phenomena is the same as sameness. With great compassion for sentient beings, the Tathāgata sees that ordinary, immature beings do not recognize this undefiled quality that is free of clinging, and so he pledges to help them realize it.
